fenix0xf/ek-tm4c1294xl/src/drv/tivaware/driverlib/pin_map.h
#define GPIO_PF1_U1CTS    0x00050401
#define GPIO_PF1_SSI1TX   0x00050402
#define GPIO_PF1_M1PWM5   0x00050405
#define GPIO_PF1_PHB0     0x00050406
#define GPIO_PF1_T0CCP1   0x00050407
#define GPIO_PF1_C1O      0x00050409
#define GPIO_PF1_TRD1     0x0005040E

#define GPIO_PF2_U1DCD    0x00050801
#define GPIO_PF2_SSI1CLK  0x00050802
#define GPIO_PF2_M0FAULT0 0x00050804
#define GPIO_PF2_M1PWM6   0x00050805
#define GPIO_PF2_T1CCP0   0x00050807
#define GPIO_PF2_C2O      0x00050809
#define GPIO_PF2_TRD0     0x0005080E

#define GPIO_PF3_U1DSR    0x00050C01
#define GPIO_PF3_SSI1FSS  0x00050C02
#define GPIO_PF3_CAN0TX   0x00050C03
#define GPIO_PF3_M0FAULT1 0x00050C04
#define GPIO_PF3_M1PWM7   0x00050C05
#define GPIO_PF3_T1CCP1   0x00050C07
#define GPIO_PF3_TRCLK    0x00050C0E

#define GPIO_PF4_U1DTR    0x00051001
#define GPIO_PF4_M0FAULT2 0x00051004
#define GPIO_PF4_M1FAULT0 0x00051005
#define GPIO_PF4_IDX0     0x00051006
#define GPIO_PF4_T2CCP0   0x00051007
#define GPIO_PF4_TRD3     0x0005100E

#define GPIO_PF5_M0FAULT3 0x00051404
#define GPIO_PF5_T2CCP1   0x00051407

#define GPIO_PF6_I2C2SCL  0x00051803
#define GPIO_PF6_T3CCP0   0x00051807

#define GPIO_PF7_I2C2SDA  0x00051C03
#define GPIO_PF7_M1FAULT0 0x00051C05
#define GPIO_PF7_T3CCP1   0x00051C07

#define GPIO_PG0_I2C3SCL  0x00060003
#define GPIO_PG0_M1FAULT1 0x00060005
#define GPIO_PG0_PHA1     0x00060006
#define GPIO_PG0_T4CCP0   0x00060007

#define GPIO_PG1_I2C3SDA  0x00060403
#define GPIO_PG1_M1FAULT2 0x00060405
#define GPIO_PG1_PHB1     0x00060406
#define GPIO_PG1_T4CCP1   0x00060407

#define GPIO_PG2_I2C4SCL  0x00060803
#define GPIO_PG2_M0FAULT1 0x00060804
#define GPIO_PG2_M1PWM0   0x00060805
#define GPIO_PG2_T5CCP0   0x00060807

#define GPIO_PG3_I2C4SDA  0x00060C03
#define GPIO_PG3_M0FAULT2 0x00060C04
#define GPIO_PG3_M1PWM1   0x00060C05
#define GPIO_PG3_PHA1     0x00060C06
#define GPIO_PG3_T5CCP1   0x00060C07

#define GPIO_PG4_U2RX     0x00061001
#define GPIO_PG4_I2C1SCL  0x00061003
#define GPIO_PG4_M0PWM4   0x00061004
#define GPIO_PG4_M1PWM2   0x00061005
#define GPIO_PG4_PHB1     0x00061006
#define GPIO_PG4_WT0CCP0  0x00061007

#define GPIO_PG5_U2TX     0x00061401
#define GPIO_PG5_I2C1SDA  0x00061403
#define GPIO_PG5_M0PWM5   0x00061404
#define GPIO_PG5_M1PWM3   0x00061405
#define GPIO_PG5_IDX1     0x00061406
#define GPIO_PG5_WT0CCP1  0x00061407

#define GPIO_PG6_I2C5SCL  0x00061803
#define GPIO_PG6_M0PWM6   0x00061804
#define GPIO_PG6_WT1CCP0  0x00061807

#define GPIO_PG7_I2C5SDA  0x00061C03
#define GPIO_PG7_M0PWM7   0x00061C04
#define GPIO_PG7_IDX1     0x00061C05
#define GPIO_PG7_WT1CCP1  0x00061C07

#define GPIO_PH0_SSI3CLK  0x00070002
#define GPIO_PH0_M0PWM0   0x00070004
#define GPIO_PH0_M0FAULT0 0x00070006
#define GPIO_PH0_WT2CCP0  0x00070007

#define GPIO_PH1_SSI3FSS  0x00070402
#define GPIO_PH1_M0PWM1   0x00070404
#define GPIO_PH1_IDX0     0x00070405
#define GPIO_PH1_M0FAULT1 0x00070406
#define GPIO_PH1_WT2CCP1  0x00070407

#define GPIO_PH2_SSI3RX   0x00070802
#define GPIO_PH2_M0PWM2   0x00070804
#define GPIO_PH2_M0FAULT2 0x00070806
#define GPIO_PH2_WT5CCP0  0x00070807

#define GPIO_PH3_SSI3TX   0x00070C02
#define GPIO_PH3_M0PWM3   0x00070C04
#define GPIO_PH3_M0FAULT3 0x00070C06
#define GPIO_PH3_WT5CCP1  0x00070C07

#define GPIO_PH4_SSI2CLK  0x00071002
#define GPIO_PH4_M0PWM4   0x00071004
#define GPIO_PH4_PHA0     0x00071005
#define GPIO_PH4_WT3CCP0  0x00071007

#define GPIO_PH5_SSI2FSS  0x00071402
#define GPIO_PH5_M0PWM5   0x00071404
#define GPIO_PH5_PHB0     0x00071405
#define GPIO_PH5_WT3CCP1  0x00071407

#define GPIO_PH6_SSI2RX   0x00071802
#define GPIO_PH6_M0PWM6   0x00071804
#define GPIO_PH6_WT4CCP0  0x00071807

#define GPIO_PH7_SSI2TX   0x00071C02
#define GPIO_PH7_M0PWM7   0x00071C04
#define GPIO_PH7_WT4CCP1  0x00071C07

#define GPIO_PJ0_U4RX     0x00080001
#define GPIO_PJ0_T1CCP0   0x00080007

#define GPIO_PJ1_U4TX     0x00080401
#define GPIO_PJ1_T1CCP1   0x00080407

#define GPIO_PJ2_U5RX     0x00080801
#define GPIO_PJ2_IDX0     0x00080805
#define GPIO_PJ2_T2CCP0   0x00080807

#define GPIO_PK0_SSI3CLK  0x00090002
#define GPIO_PK0_M1FAULT0 0x00090006

#define GPIO_PK1_SSI3FSS  0x00090402
#define GPIO_PK1_M1FAULT1 0x00090406

#define GPIO_PK2_SSI3RX   0x00090802
#define GPIO_PK2_M1FAULT2 0x00090806

#define GPIO_PK3_SSI3TX   0x00090C02
#define GPIO_PK3_M1FAULT3 0x00090C06

#endif // PART_TM4C123BE6PZ

//*****************************************************************************
//
// TM4C123BH6PM Port/Pin Mapping Definitions
//
//*****************************************************************************
#ifdef PART_TM4C123BH6PM

#define GPIO_PA0_U0RX     0x00000001
#define GPIO_PA0_CAN1RX   0x00000008

#define GPIO_PA1_U0TX     0x00000401
#define GPIO_PA1_CAN1TX   0x00000408

#define GPIO_PA2_SSI0CLK  0x00000802

#define GPIO_PA3_SSI0FSS  0x00000C02

#define GPIO_PA4_SSI0RX   0x00001002

#define GPIO_PA5_SSI0TX   0x00001402

#define GPIO_PA6_I2C1SCL  0x00001803
#define GPIO_PA6_M1PWM2   0x00001805

#define GPIO_PA7_I2C1SDA  0x00001C03
#define GPIO_PA7_M1PWM3   0x00001C05

#define GPIO_PB0_U1RX     0x00010001
#define GPIO_PB0_T2CCP0   0x00010007

#define GPIO_PB1_U1TX     0x00010401
#define GPIO_PB1_T2CCP1   0x00010407

#define GPIO_PB2_I2C0SCL  0x00010803
#define GPIO_PB2_T3CCP0   0x00010807

#define GPIO_PB3_I2C0SDA  0x00010C03
#define GPIO_PB3_T3CCP1   0x00010C07

#define GPIO_PB4_SSI2CLK  0x00011002
#define GPIO_PB4_M0PWM2   0x00011004
#define GPIO_PB4_T1CCP0   0x00011007
#define GPIO_PB4_CAN0RX   0x00011008

#define GPIO_PB5_SSI2FSS  0x00011402
#define GPIO_PB5_M0PWM3   0x00011404
#define GPIO_PB5_T1CCP1   0x00011407
#define GPIO_PB5_CAN0TX   0x00011408

#define GPIO_PB6_SSI2RX   0x00011802
#define GPIO_PB6_M0PWM0   0x00011804
#define GPIO_PB6_T0CCP0   0x00011807

#define GPIO_PB7_SSI2TX   0x00011C02
#define GPIO_PB7_M0PWM1   0x00011C04
#define GPIO_PB7_T0CCP1   0x00011C07

#define GPIO_PC0_TCK      0x00020001
#define GPIO_PC0_SWCLK    0x00020001
#define GPIO_PC0_T4CCP0   0x00020007

#define GPIO_PC1_TMS      0x00020401
#define GPIO_PC1_SWDIO    0x00020401
#define GPIO_PC1_T4CCP1   0x00020407

#define GPIO_PC2_TDI      0x00020801
#define GPIO_PC2_T5CCP0   0x00020807

