fenix0xf/ek-tm4c1294xl/src/drv/tivaware/driverlib/pin_map.h
#define GPIO_PD6_U2RX    0x00031801
#define GPIO_PD6_WT5CCP0 0x00031807

#define GPIO_PD7_U2TX    0x00031C01
#define GPIO_PD7_WT5CCP1 0x00031C07
#define GPIO_PD7_NMI     0x00031C08

#define GPIO_PE0_U7RX    0x00040001

#define GPIO_PE1_U7TX    0x00040401

#define GPIO_PE4_U5RX    0x00041001
#define GPIO_PE4_I2C2SCL 0x00041003
#define GPIO_PE4_CAN0RX  0x00041008

#define GPIO_PE5_U5TX    0x00041401
#define GPIO_PE5_I2C2SDA 0x00041403
#define GPIO_PE5_CAN0TX  0x00041408

#define GPIO_PE7_U1RI    0x00041C01

#define GPIO_PF0_U1RTS   0x00050001
#define GPIO_PF0_SSI1RX  0x00050002
#define GPIO_PF0_CAN0RX  0x00050003
#define GPIO_PF0_T0CCP0  0x00050007
#define GPIO_PF0_NMI     0x00050008
#define GPIO_PF0_C0O     0x00050009
#define GPIO_PF0_TRD2    0x0005000E

#define GPIO_PF1_U1CTS   0x00050401
#define GPIO_PF1_SSI1TX  0x00050402
#define GPIO_PF1_T0CCP1  0x00050407
#define GPIO_PF1_C1O     0x00050409
#define GPIO_PF1_TRD1    0x0005040E

#define GPIO_PF2_U1DCD   0x00050801
#define GPIO_PF2_SSI1CLK 0x00050802
#define GPIO_PF2_T1CCP0  0x00050807
#define GPIO_PF2_C2O     0x00050809
#define GPIO_PF2_TRD0    0x0005080E

#define GPIO_PF3_U1DSR   0x00050C01
#define GPIO_PF3_SSI1FSS 0x00050C02
#define GPIO_PF3_CAN0TX  0x00050C03
#define GPIO_PF3_T1CCP1  0x00050C07
#define GPIO_PF3_TRCLK   0x00050C0E

#define GPIO_PF4_U1DTR   0x00051001
#define GPIO_PF4_T2CCP0  0x00051007
#define GPIO_PF4_TRD3    0x0005100E

#define GPIO_PF5_T2CCP1  0x00051407

#define GPIO_PF6_I2C2SCL 0x00051803
#define GPIO_PF6_T3CCP0  0x00051807

#define GPIO_PF7_I2C2SDA 0x00051C03
#define GPIO_PF7_T3CCP1  0x00051C07

#define GPIO_PG0_I2C3SCL 0x00060003
#define GPIO_PG0_T4CCP0  0x00060007

#define GPIO_PG1_I2C3SDA 0x00060403
#define GPIO_PG1_T4CCP1  0x00060407

#define GPIO_PG2_I2C4SCL 0x00060803
#define GPIO_PG2_T5CCP0  0x00060807

#define GPIO_PG3_I2C4SDA 0x00060C03
#define GPIO_PG3_T5CCP1  0x00060C07

#define GPIO_PG4_U2RX    0x00061001
#define GPIO_PG4_I2C1SCL 0x00061003
#define GPIO_PG4_WT0CCP0 0x00061007

#define GPIO_PG5_U2TX    0x00061401
#define GPIO_PG5_I2C1SDA 0x00061403
#define GPIO_PG5_WT0CCP1 0x00061407

#define GPIO_PG6_I2C5SCL 0x00061803
#define GPIO_PG6_WT1CCP0 0x00061807

#define GPIO_PG7_I2C5SDA 0x00061C03
#define GPIO_PG7_WT1CCP1 0x00061C07

#define GPIO_PH0_SSI3CLK 0x00070002
#define GPIO_PH0_WT2CCP0 0x00070007

#define GPIO_PH1_SSI3FSS 0x00070402
#define GPIO_PH1_WT2CCP1 0x00070407

#define GPIO_PH2_SSI3RX  0x00070802
#define GPIO_PH2_WT5CCP0 0x00070807

#define GPIO_PH3_SSI3TX  0x00070C02
#define GPIO_PH3_WT5CCP1 0x00070C07

#define GPIO_PH4_SSI2CLK 0x00071002
#define GPIO_PH4_WT3CCP0 0x00071007

#define GPIO_PH5_SSI2FSS 0x00071402
#define GPIO_PH5_WT3CCP1 0x00071407

#define GPIO_PH6_SSI2RX  0x00071802
#define GPIO_PH6_WT4CCP0 0x00071807

#define GPIO_PH7_SSI2TX  0x00071C02
#define GPIO_PH7_WT4CCP1 0x00071C07

#define GPIO_PJ0_U4RX    0x00080001
#define GPIO_PJ0_T1CCP0  0x00080007

#define GPIO_PJ1_U4TX    0x00080401
#define GPIO_PJ1_T1CCP1  0x00080407

#define GPIO_PJ2_U5RX    0x00080801
#define GPIO_PJ2_T2CCP0  0x00080807

#define GPIO_PJ3_U5TX    0x00080C01
#define GPIO_PJ3_T2CCP1  0x00080C07

#define GPIO_PJ4_U6RX    0x00081001
#define GPIO_PJ4_T3CCP0  0x00081007

#define GPIO_PJ5_U6TX    0x00081401
#define GPIO_PJ5_T3CCP1  0x00081407

#define GPIO_PK0_SSI3CLK 0x00090002

#define GPIO_PK1_SSI3FSS 0x00090402

#define GPIO_PK2_SSI3RX  0x00090802

#define GPIO_PK3_SSI3TX  0x00090C02

#define GPIO_PK4_U7RX    0x00091001
#define GPIO_PK4_RTCCLK  0x00091007
#define GPIO_PK4_C0O     0x00091008

#define GPIO_PK5_U7TX    0x00091401
#define GPIO_PK5_C1O     0x00091408

#define GPIO_PK6_WT1CCP0 0x00091807
#define GPIO_PK6_C2O     0x00091808

#define GPIO_PK7_WT1CCP1 0x00091C07

#define GPIO_PL0_T0CCP0  0x000A0007
#define GPIO_PL0_WT0CCP0 0x000A0008

#define GPIO_PL1_T0CCP1  0x000A0407
#define GPIO_PL1_WT0CCP1 0x000A0408

#define GPIO_PL2_T1CCP0  0x000A0807
#define GPIO_PL2_WT1CCP0 0x000A0808

#define GPIO_PL3_T1CCP1  0x000A0C07
#define GPIO_PL3_WT1CCP1 0x000A0C08

#define GPIO_PL4_T2CCP0  0x000A1007
#define GPIO_PL4_WT2CCP0 0x000A1008

#define GPIO_PL5_T2CCP1  0x000A1407
#define GPIO_PL5_WT2CCP1 0x000A1408

#define GPIO_PL6_T3CCP0  0x000A1807
#define GPIO_PL6_WT3CCP0 0x000A1808

#define GPIO_PL7_T3CCP1  0x000A1C07
#define GPIO_PL7_WT3CCP1 0x000A1C08

#define GPIO_PM0_T4CCP0  0x000B0007
#define GPIO_PM0_WT4CCP0 0x000B0008

#define GPIO_PM1_T4CCP1  0x000B0407
#define GPIO_PM1_WT4CCP1 0x000B0408

#define GPIO_PM2_T5CCP0  0x000B0807
#define GPIO_PM2_WT5CCP0 0x000B0808

#define GPIO_PM3_T5CCP1  0x000B0C07
#define GPIO_PM3_WT5CCP1 0x000B0C08

#define GPIO_PM6_WT0CCP0 0x000B1807

#define GPIO_PM7_WT0CCP1 0x000B1C07

#define GPIO_PN0_CAN0RX  0x000C0001

#define GPIO_PN1_CAN0TX  0x000C0401

#define GPIO_PN2_WT2CCP0 0x000C0807

#define GPIO_PN3_WT2CCP1 0x000C0C07

#define GPIO_PN4_WT3CCP0 0x000C1007

#define GPIO_PN5_WT3CCP1 0x000C1407

#define GPIO_PN6_WT4CCP0 0x000C1807

#define GPIO_PN7_WT4CCP1 0x000C1C07

#define GPIO_PP0_T4CCP0  0x000D0007

#define GPIO_PP1_T4CCP1  0x000D0407

#define GPIO_PP2_T5CCP0  0x000D0807

#endif // PART_TM4C1233H6PGE

//*****************************************************************************
//
// TM4C1237H6PGE Port/Pin Mapping Definitions
//
//*****************************************************************************
#ifdef PART_TM4C1237H6PGE

#define GPIO_PA0_U0RX     0x00000001

#define GPIO_PA1_U0TX     0x00000401

#define GPIO_PA2_SSI0CLK  0x00000802

#define GPIO_PA3_SSI0FSS  0x00000C02

#define GPIO_PA4_SSI0RX   0x00001002

#define GPIO_PA5_SSI0TX   0x00001402

#define GPIO_PA6_I2C1SCL  0x00001803

#define GPIO_PA7_I2C1SDA  0x00001C03

#define GPIO_PB0_U1RX     0x00010001
#define GPIO_PB0_T2CCP0   0x00010007

#define GPIO_PB1_U1TX     0x00010401
#define GPIO_PB1_T2CCP1   0x00010407

#define GPIO_PB2_I2C0SCL  0x00010803
#define GPIO_PB2_T3CCP0   0x00010807

#define GPIO_PB3_I2C0SDA  0x00010C03
#define GPIO_PB3_T3CCP1   0x00010C07

#define GPIO_PB4_SSI2CLK  0x00011002
#define GPIO_PB4_T1CCP0   0x00011007
#define GPIO_PB4_CAN0RX   0x00011008

#define GPIO_PB5_SSI2FSS  0x00011402
#define GPIO_PB5_T1CCP1   0x00011407
#define GPIO_PB5_CAN0TX   0x00011408

