fenix0xf/ek-tm4c1294xl/src/drv/tivaware/driverlib/pin_map.h
#define GPIO_PG0_I2C3SCL  0x00060003
#define GPIO_PG0_M1FAULT1 0x00060005
#define GPIO_PG0_PHA1     0x00060006
#define GPIO_PG0_T4CCP0   0x00060007

#define GPIO_PG1_I2C3SDA  0x00060403
#define GPIO_PG1_M1FAULT2 0x00060405
#define GPIO_PG1_PHB1     0x00060406
#define GPIO_PG1_T4CCP1   0x00060407

#define GPIO_PG2_I2C4SCL  0x00060803
#define GPIO_PG2_M0FAULT1 0x00060804
#define GPIO_PG2_M1PWM0   0x00060805
#define GPIO_PG2_T5CCP0   0x00060807

#define GPIO_PG3_I2C4SDA  0x00060C03
#define GPIO_PG3_M0FAULT2 0x00060C04
#define GPIO_PG3_M1PWM1   0x00060C05
#define GPIO_PG3_PHA1     0x00060C06
#define GPIO_PG3_T5CCP1   0x00060C07

#define GPIO_PG4_U2RX     0x00061001
#define GPIO_PG4_I2C1SCL  0x00061003
#define GPIO_PG4_M0PWM4   0x00061004
#define GPIO_PG4_M1PWM2   0x00061005
#define GPIO_PG4_PHB1     0x00061006
#define GPIO_PG4_WT0CCP0  0x00061007

#define GPIO_PG5_U2TX     0x00061401
#define GPIO_PG5_I2C1SDA  0x00061403
#define GPIO_PG5_M0PWM5   0x00061404
#define GPIO_PG5_M1PWM3   0x00061405
#define GPIO_PG5_IDX1     0x00061406
#define GPIO_PG5_WT0CCP1  0x00061407

#define GPIO_PG6_I2C5SCL  0x00061803
#define GPIO_PG6_M0PWM6   0x00061804
#define GPIO_PG6_WT1CCP0  0x00061807

#define GPIO_PG7_I2C5SDA  0x00061C03
#define GPIO_PG7_M0PWM7   0x00061C04
#define GPIO_PG7_IDX1     0x00061C05
#define GPIO_PG7_WT1CCP1  0x00061C07

#define GPIO_PH0_SSI3CLK  0x00070002
#define GPIO_PH0_M0PWM0   0x00070004
#define GPIO_PH0_M0FAULT0 0x00070006
#define GPIO_PH0_WT2CCP0  0x00070007

#define GPIO_PH1_SSI3FSS  0x00070402
#define GPIO_PH1_M0PWM1   0x00070404
#define GPIO_PH1_IDX0     0x00070405
#define GPIO_PH1_M0FAULT1 0x00070406
#define GPIO_PH1_WT2CCP1  0x00070407

#define GPIO_PH2_SSI3RX   0x00070802
#define GPIO_PH2_M0PWM2   0x00070804
#define GPIO_PH2_M0FAULT2 0x00070806
#define GPIO_PH2_WT5CCP0  0x00070807

#define GPIO_PH3_SSI3TX   0x00070C02
#define GPIO_PH3_M0PWM3   0x00070C04
#define GPIO_PH3_M0FAULT3 0x00070C06
#define GPIO_PH3_WT5CCP1  0x00070C07

#define GPIO_PH4_SSI2CLK  0x00071002
#define GPIO_PH4_M0PWM4   0x00071004
#define GPIO_PH4_PHA0     0x00071005
#define GPIO_PH4_WT3CCP0  0x00071007

#define GPIO_PH5_SSI2FSS  0x00071402
#define GPIO_PH5_M0PWM5   0x00071404
#define GPIO_PH5_PHB0     0x00071405
#define GPIO_PH5_WT3CCP1  0x00071407

#define GPIO_PH6_SSI2RX   0x00071802
#define GPIO_PH6_M0PWM6   0x00071804
#define GPIO_PH6_WT4CCP0  0x00071807

#define GPIO_PH7_SSI2TX   0x00071C02
#define GPIO_PH7_M0PWM7   0x00071C04
#define GPIO_PH7_WT4CCP1  0x00071C07

#define GPIO_PJ0_U4RX     0x00080001
#define GPIO_PJ0_T1CCP0   0x00080007

#define GPIO_PJ1_U4TX     0x00080401
#define GPIO_PJ1_T1CCP1   0x00080407

#define GPIO_PJ2_U5RX     0x00080801
#define GPIO_PJ2_IDX0     0x00080805
#define GPIO_PJ2_T2CCP0   0x00080807

#define GPIO_PJ3_U5TX     0x00080C01
#define GPIO_PJ3_T2CCP1   0x00080C07

#define GPIO_PJ4_U6RX     0x00081001
#define GPIO_PJ4_T3CCP0   0x00081007

#define GPIO_PJ5_U6TX     0x00081401
#define GPIO_PJ5_T3CCP1   0x00081407

#define GPIO_PK0_SSI3CLK  0x00090002
#define GPIO_PK0_M1FAULT0 0x00090006

#define GPIO_PK1_SSI3FSS  0x00090402
#define GPIO_PK1_M1FAULT1 0x00090406

#define GPIO_PK2_SSI3RX   0x00090802
#define GPIO_PK2_M1FAULT2 0x00090806

#define GPIO_PK3_SSI3TX   0x00090C02
#define GPIO_PK3_M1FAULT3 0x00090C06

#define GPIO_PK4_U7RX     0x00091001
#define GPIO_PK4_M0FAULT0 0x00091006
#define GPIO_PK4_RTCCLK   0x00091007
#define GPIO_PK4_C0O      0x00091008

#define GPIO_PK5_U7TX     0x00091401
#define GPIO_PK5_M0FAULT1 0x00091406
#define GPIO_PK5_C1O      0x00091408

#define GPIO_PK6_M0FAULT2 0x00091806
#define GPIO_PK6_WT1CCP0  0x00091807
#define GPIO_PK6_C2O      0x00091808

#define GPIO_PK7_M0FAULT3 0x00091C06
#define GPIO_PK7_WT1CCP1  0x00091C07

#define GPIO_PL0_T0CCP0   0x000A0007
#define GPIO_PL0_WT0CCP0  0x000A0008

#define GPIO_PL1_T0CCP1   0x000A0407
#define GPIO_PL1_WT0CCP1  0x000A0408

#define GPIO_PL2_T1CCP0   0x000A0807
#define GPIO_PL2_WT1CCP0  0x000A0808

#define GPIO_PL3_T1CCP1   0x000A0C07
#define GPIO_PL3_WT1CCP1  0x000A0C08

#define GPIO_PL4_T2CCP0   0x000A1007
#define GPIO_PL4_WT2CCP0  0x000A1008

#define GPIO_PL5_T2CCP1   0x000A1407
#define GPIO_PL5_WT2CCP1  0x000A1408

#define GPIO_PL6_T3CCP0   0x000A1807
#define GPIO_PL6_WT3CCP0  0x000A1808

#define GPIO_PL7_T3CCP1   0x000A1C07
#define GPIO_PL7_WT3CCP1  0x000A1C08

#define GPIO_PM0_T4CCP0   0x000B0007
#define GPIO_PM0_WT4CCP0  0x000B0008

#define GPIO_PM1_T4CCP1   0x000B0407
#define GPIO_PM1_WT4CCP1  0x000B0408

#define GPIO_PM2_T5CCP0   0x000B0807
#define GPIO_PM2_WT5CCP0  0x000B0808

#define GPIO_PM3_T5CCP1   0x000B0C07
#define GPIO_PM3_WT5CCP1  0x000B0C08

#define GPIO_PM6_M0PWM4   0x000B1802
#define GPIO_PM6_WT0CCP0  0x000B1807

#define GPIO_PM7_M0PWM5   0x000B1C02
#define GPIO_PM7_WT0CCP1  0x000B1C07

#define GPIO_PN0_CAN0RX   0x000C0001

#define GPIO_PN1_CAN0TX   0x000C0401

#define GPIO_PN2_M0PWM6   0x000C0802
#define GPIO_PN2_WT2CCP0  0x000C0807

#define GPIO_PN3_M0PWM7   0x000C0C02
#define GPIO_PN3_WT2CCP1  0x000C0C07

#define GPIO_PN4_M1PWM4   0x000C1002
#define GPIO_PN4_WT3CCP0  0x000C1007

#define GPIO_PN5_M1PWM5   0x000C1402
#define GPIO_PN5_WT3CCP1  0x000C1407

#define GPIO_PN6_M1PWM6   0x000C1802
#define GPIO_PN6_WT4CCP0  0x000C1807

#define GPIO_PN7_M1PWM7   0x000C1C02
#define GPIO_PN7_WT4CCP1  0x000C1C07

#define GPIO_PP0_M0PWM0   0x000D0001
#define GPIO_PP0_T4CCP0   0x000D0007

#define GPIO_PP1_M0PWM1   0x000D0401
#define GPIO_PP1_T4CCP1   0x000D0407

#define GPIO_PP2_M0PWM2   0x000D0801
#define GPIO_PP2_T5CCP0   0x000D0807

#endif // PART_TM4C123BH6PGE

//*****************************************************************************
//
// TM4C123BH6ZRB Port/Pin Mapping Definitions
//
//*****************************************************************************
#ifdef PART_TM4C123BH6ZRB

#define GPIO_PA0_U0RX     0x00000001
#define GPIO_PA0_CAN1RX   0x00000008

#define GPIO_PA1_U0TX     0x00000401
#define GPIO_PA1_CAN1TX   0x00000408

#define GPIO_PA2_SSI0CLK  0x00000802

#define GPIO_PA3_SSI0FSS  0x00000C02

