fenix0xf/ek-tm4c1294xl/src/drv/tivaware/driverlib/pin_map.h
#endif // PART_TM4C1292NCPDT

//*****************************************************************************
//
// TM4C1292NCZAD Port/Pin Mapping Definitions
//
//*****************************************************************************
#ifdef PART_TM4C1292NCZAD

#define GPIO_PA0_U0RX        0x00000001
#define GPIO_PA0_I2C9SCL     0x00000002
#define GPIO_PA0_T0CCP0      0x00000003
#define GPIO_PA0_CAN0RX      0x00000007

#define GPIO_PA1_U0TX        0x00000401
#define GPIO_PA1_I2C9SDA     0x00000402
#define GPIO_PA1_T0CCP1      0x00000403
#define GPIO_PA1_CAN0TX      0x00000407

#define GPIO_PA2_U4RX        0x00000801
#define GPIO_PA2_I2C8SCL     0x00000802
#define GPIO_PA2_T1CCP0      0x00000803
#define GPIO_PA2_SSI0CLK     0x0000080F

#define GPIO_PA3_U4TX        0x00000C01
#define GPIO_PA3_I2C8SDA     0x00000C02
#define GPIO_PA3_T1CCP1      0x00000C03
#define GPIO_PA3_SSI0FSS     0x00000C0F

#define GPIO_PA4_U3RX        0x00001001
#define GPIO_PA4_T2CCP0      0x00001003
#define GPIO_PA4_I2C7SCL     0x00001002
#define GPIO_PA4_SSI0XDAT0   0x0000100F

#define GPIO_PA5_U3TX        0x00001401
#define GPIO_PA5_T2CCP1      0x00001403
#define GPIO_PA5_I2C7SDA     0x00001402
#define GPIO_PA5_SSI0XDAT1   0x0000140F

#define GPIO_PA6_U2RX        0x00001801
#define GPIO_PA6_I2C6SCL     0x00001802
#define GPIO_PA6_T3CCP0      0x00001803
#define GPIO_PA6_USB0EPEN    0x00001805
#define GPIO_PA6_SSI0XDAT2   0x0000180D
#define GPIO_PA6_EN0RXCK     0x0000180E
#define GPIO_PA6_EPI0S8      0x0000180F

#define GPIO_PA7_U2TX        0x00001C01
#define GPIO_PA7_I2C6SDA     0x00001C02
#define GPIO_PA7_T3CCP1      0x00001C03
#define GPIO_PA7_USB0PFLT    0x00001C05
#define GPIO_PA7_USB0EPEN    0x00001C0B
#define GPIO_PA7_SSI0XDAT3   0x00001C0D
#define GPIO_PA7_EPI0S9      0x00001C0F

#define GPIO_PB0_U1RX        0x00010001
#define GPIO_PB0_I2C5SCL     0x00010002
#define GPIO_PB0_CAN1RX      0x00010007
#define GPIO_PB0_T4CCP0      0x00010003

#define GPIO_PB1_U1TX        0x00010401
#define GPIO_PB1_I2C5SDA     0x00010402
#define GPIO_PB1_CAN1TX      0x00010407
#define GPIO_PB1_T4CCP1      0x00010403

#define GPIO_PB2_T5CCP0      0x00010803
#define GPIO_PB2_I2C0SCL     0x00010802
#define GPIO_PB2_EN0MDC      0x00010805
#define GPIO_PB2_USB0STP     0x0001080E
#define GPIO_PB2_EPI0S27     0x0001080F

#define GPIO_PB3_I2C0SDA     0x00010C02
#define GPIO_PB3_T5CCP1      0x00010C03
#define GPIO_PB3_EN0MDIO     0x00010C05
#define GPIO_PB3_USB0CLK     0x00010C0E
#define GPIO_PB3_EPI0S28     0x00010C0F

#define GPIO_PB4_U0CTS       0x00011001
#define GPIO_PB4_I2C5SCL     0x00011002
#define GPIO_PB4_SSI1FSS     0x0001100F

#define GPIO_PB5_U0RTS       0x00011401
#define GPIO_PB5_I2C5SDA     0x00011402
#define GPIO_PB5_SSI1CLK     0x0001140F

#define GPIO_PB6_I2C6SCL     0x00011802
#define GPIO_PB6_T6CCP0      0x00011803

#define GPIO_PB7_I2C6SDA     0x00011C02
#define GPIO_PB7_T6CCP1      0x00011C03

#define GPIO_PC0_TCK         0x00020001
#define GPIO_PC0_SWCLK       0x00020001

#define GPIO_PC1_TMS         0x00020401
#define GPIO_PC1_SWDIO       0x00020401

#define GPIO_PC2_TDI         0x00020801

#define GPIO_PC3_SWO         0x00020C01
#define GPIO_PC3_TDO         0x00020C01

#define GPIO_PC4_U7RX        0x00021001
#define GPIO_PC4_T7CCP0      0x00021003
#define GPIO_PC4_EPI0S7      0x0002100F

#define GPIO_PC5_U7TX        0x00021401
#define GPIO_PC5_T7CCP1      0x00021403
#define GPIO_PC5_RTCCLK      0x00021407
#define GPIO_PC5_EPI0S6      0x0002140F

#define GPIO_PC6_U5RX        0x00021801
#define GPIO_PC6_EPI0S5      0x0002180F

#define GPIO_PC7_U5TX        0x00021C01
#define GPIO_PC7_EPI0S4      0x00021C0F

#define GPIO_PD0_I2C7SCL     0x00030002
#define GPIO_PD0_T0CCP0      0x00030003
#define GPIO_PD0_C0O         0x00030005
#define GPIO_PD0_SSI2XDAT1   0x0003000F

#define GPIO_PD1_I2C7SDA     0x00030402
#define GPIO_PD1_T0CCP1      0x00030403
#define GPIO_PD1_C1O         0x00030405
#define GPIO_PD1_SSI2XDAT0   0x0003040F

#define GPIO_PD2_I2C8SCL     0x00030802
#define GPIO_PD2_T1CCP0      0x00030803
#define GPIO_PD2_C2O         0x00030805
#define GPIO_PD2_SSI2FSS     0x0003080F

#define GPIO_PD3_I2C8SDA     0x00030C02
#define GPIO_PD3_T1CCP1      0x00030C03
#define GPIO_PD3_SSI2CLK     0x00030C0F

#define GPIO_PD4_U2RX        0x00031001
#define GPIO_PD4_T3CCP0      0x00031003
#define GPIO_PD4_SSI1XDAT2   0x0003100F

#define GPIO_PD5_U2TX        0x00031401
#define GPIO_PD5_T3CCP1      0x00031403
#define GPIO_PD5_SSI1XDAT3   0x0003140F

#define GPIO_PD6_U2RTS       0x00031801
#define GPIO_PD6_T4CCP0      0x00031803
#define GPIO_PD6_USB0EPEN    0x00031805
#define GPIO_PD6_SSI2XDAT3   0x0003180F

#define GPIO_PD7_U2CTS       0x00031C01
#define GPIO_PD7_T4CCP1      0x00031C03
#define GPIO_PD7_USB0PFLT    0x00031C05
#define GPIO_PD7_NMI         0x00031C08
#define GPIO_PD7_SSI2XDAT2   0x00031C0F

#define GPIO_PE0_U1RTS       0x00040001

#define GPIO_PE1_U1DSR       0x00040401

#define GPIO_PE2_U1DCD       0x00040801

#define GPIO_PE3_U1DTR       0x00040C01

#define GPIO_PE4_U1RI        0x00041001
#define GPIO_PE4_SSI1XDAT0   0x0004100F

#define GPIO_PE5_SSI1XDAT1   0x0004140F

#define GPIO_PE6_U0CTS       0x00041801
#define GPIO_PE6_I2C9SCL     0x00041802

#define GPIO_PE7_U0RTS       0x00041C01
#define GPIO_PE7_I2C9SDA     0x00041C02
#define GPIO_PE7_NMI         0x00041C08

#define GPIO_PF0_M0PWM0      0x00050006
#define GPIO_PF0_SSI3XDAT1   0x0005000E
#define GPIO_PF0_TRD2        0x0005000F

#define GPIO_PF1_M0PWM1      0x00050406
#define GPIO_PF1_SSI3XDAT0   0x0005040E
#define GPIO_PF1_TRD1        0x0005040F

#define GPIO_PF2_EN0MDC      0x00050805
#define GPIO_PF2_M0PWM2      0x00050806
#define GPIO_PF2_SSI3FSS     0x0005080E
#define GPIO_PF2_TRD0        0x0005080F

#define GPIO_PF3_EN0MDIO     0x00050C05
#define GPIO_PF3_M0PWM3      0x00050C06
#define GPIO_PF3_SSI3CLK     0x00050C0E
#define GPIO_PF3_TRCLK       0x00050C0F

#define GPIO_PF4_M0FAULT0    0x00051006
#define GPIO_PF4_SSI3XDAT2   0x0005100E
#define GPIO_PF4_TRD3        0x0005100F

