fenix0xf/ek-tm4c1294xl/src/drv/tivaware/driverlib/pin_map.h
#define GPIO_PQ7_U1RI      0x000E1C01

#define GPIO_PR0_U4TX      0x000F0001
#define GPIO_PR0_I2C1SCL   0x000F0002
#define GPIO_PR0_M0PWM0    0x000F0006
#define GPIO_PR0_LCDCP     0x000F000F

#define GPIO_PR1_U4RX      0x000F0401
#define GPIO_PR1_I2C1SDA   0x000F0402
#define GPIO_PR1_M0PWM1    0x000F0406
#define GPIO_PR1_LCDFP     0x000F040F

#define GPIO_PR2_I2C2SCL   0x000F0802
#define GPIO_PR2_M0PWM2    0x000F0806
#define GPIO_PR2_LCDLP     0x000F080F

#define GPIO_PR3_I2C2SDA   0x000F0C02
#define GPIO_PR3_M0PWM3    0x000F0C06
#define GPIO_PR3_LCDDATA03 0x000F0C0F

#define GPIO_PR4_I2C3SCL   0x000F1002
#define GPIO_PR4_T0CCP0    0x000F1003
#define GPIO_PR4_M0PWM4    0x000F1006
#define GPIO_PR4_LCDDATA00 0x000F100F

#define GPIO_PR5_U1RX      0x000F1401
#define GPIO_PR5_I2C3SDA   0x000F1402
#define GPIO_PR5_T0CCP1    0x000F1403
#define GPIO_PR5_M0PWM5    0x000F1406
#define GPIO_PR5_LCDDATA01 0x000F140F

#define GPIO_PR6_U1TX      0x000F1801
#define GPIO_PR6_I2C4SCL   0x000F1802
#define GPIO_PR6_T1CCP0    0x000F1803
#define GPIO_PR6_M0PWM6    0x000F1806
#define GPIO_PR6_LCDDATA04 0x000F180F

#define GPIO_PR7_I2C4SDA   0x000F1C02
#define GPIO_PR7_T1CCP1    0x000F1C03
#define GPIO_PR7_M0PWM7    0x000F1C06
#define GPIO_PR7_LCDDATA05 0x000F1C0F

#define GPIO_PS0_T2CCP0    0x00100003
#define GPIO_PS0_M0FAULT0  0x00100006
#define GPIO_PS0_LCDDATA20 0x0010000F

#define GPIO_PS1_T2CCP1    0x00100403
#define GPIO_PS1_M0FAULT1  0x00100406
#define GPIO_PS1_LCDDATA21 0x0010040F

#define GPIO_PS2_U1DSR     0x00100801
#define GPIO_PS2_T3CCP0    0x00100803
#define GPIO_PS2_M0FAULT2  0x00100806
#define GPIO_PS2_LCDDATA22 0x0010080F

#define GPIO_PS3_T3CCP1    0x00100C03
#define GPIO_PS3_M0FAULT3  0x00100C06
#define GPIO_PS3_LCDDATA23 0x00100C0F

#define GPIO_PS4_T4CCP0    0x00101003
#define GPIO_PS4_PHA0      0x00101006
#define GPIO_PS4_LCDDATA06 0x0010100F

#define GPIO_PS5_T4CCP1    0x00101403
#define GPIO_PS5_PHB0      0x00101406
#define GPIO_PS5_LCDDATA07 0x0010140F

#define GPIO_PS6_T5CCP0    0x00101803
#define GPIO_PS6_IDX0      0x00101806
#define GPIO_PS6_LCDDATA08 0x0010180F

#define GPIO_PS7_T5CCP1    0x00101C03
#define GPIO_PS7_LCDDATA09 0x00101C0F

#define GPIO_PT0_T6CCP0    0x00110003
#define GPIO_PT0_CAN0RX    0x00110007
#define GPIO_PT0_LCDDATA10 0x0011000F

#define GPIO_PT1_T6CCP1    0x00110403
#define GPIO_PT1_CAN0TX    0x00110407
#define GPIO_PT1_LCDDATA11 0x0011040F

#define GPIO_PT2_T7CCP0    0x00110803
#define GPIO_PT2_CAN1RX    0x00110807
#define GPIO_PT2_LCDDATA18 0x0011080F

#define GPIO_PT3_T7CCP1    0x00110C03
#define GPIO_PT3_CAN1TX    0x00110C07
#define GPIO_PT3_LCDDATA19 0x00110C0F

#endif // PART_TM4C1299NCZAD

//*****************************************************************************
//
// TM4C129CNCPDT Port/Pin Mapping Definitions
//
//*****************************************************************************
#ifdef PART_TM4C129CNCPDT

#define GPIO_PA0_U0RX      0x00000001
#define GPIO_PA0_I2C9SCL   0x00000002
#define GPIO_PA0_T0CCP0    0x00000003
#define GPIO_PA0_CAN0RX    0x00000007

#define GPIO_PA1_U0TX      0x00000401
#define GPIO_PA1_I2C9SDA   0x00000402
#define GPIO_PA1_T0CCP1    0x00000403
#define GPIO_PA1_CAN0TX    0x00000407

#define GPIO_PA2_U4RX      0x00000801
#define GPIO_PA2_I2C8SCL   0x00000802
#define GPIO_PA2_T1CCP0    0x00000803
#define GPIO_PA2_SSI0CLK   0x0000080F

#define GPIO_PA3_U4TX      0x00000C01
#define GPIO_PA3_I2C8SDA   0x00000C02
#define GPIO_PA3_T1CCP1    0x00000C03
#define GPIO_PA3_SSI0FSS   0x00000C0F

#define GPIO_PA4_U3RX      0x00001001
#define GPIO_PA4_T2CCP0    0x00001003
#define GPIO_PA4_I2C7SCL   0x00001002
#define GPIO_PA4_SSI0XDAT0 0x0000100F

#define GPIO_PA5_U3TX      0x00001401
#define GPIO_PA5_T2CCP1    0x00001403
#define GPIO_PA5_I2C7SDA   0x00001402
#define GPIO_PA5_SSI0XDAT1 0x0000140F

#define GPIO_PA6_U2RX      0x00001801
#define GPIO_PA6_I2C6SCL   0x00001802
#define GPIO_PA6_T3CCP0    0x00001803
#define GPIO_PA6_USB0EPEN  0x00001805
#define GPIO_PA6_SSI0XDAT2 0x0000180D
#define GPIO_PA6_EPI0S8    0x0000180F

#define GPIO_PA7_U2TX      0x00001C01
#define GPIO_PA7_I2C6SDA   0x00001C02
#define GPIO_PA7_T3CCP1    0x00001C03
#define GPIO_PA7_USB0PFLT  0x00001C05
#define GPIO_PA7_USB0EPEN  0x00001C0B
#define GPIO_PA7_SSI0XDAT3 0x00001C0D
#define GPIO_PA7_EPI0S9    0x00001C0F

#define GPIO_PB0_U1RX      0x00010001
#define GPIO_PB0_I2C5SCL   0x00010002
#define GPIO_PB0_CAN1RX    0x00010007
#define GPIO_PB0_T4CCP0    0x00010003

#define GPIO_PB1_U1TX      0x00010401
#define GPIO_PB1_I2C5SDA   0x00010402
#define GPIO_PB1_CAN1TX    0x00010407
#define GPIO_PB1_T4CCP1    0x00010403

#define GPIO_PB2_T5CCP0    0x00010803
#define GPIO_PB2_I2C0SCL   0x00010802
#define GPIO_PB2_USB0STP   0x0001080E
#define GPIO_PB2_EPI0S27   0x0001080F

#define GPIO_PB3_I2C0SDA   0x00010C02
#define GPIO_PB3_T5CCP1    0x00010C03
#define GPIO_PB3_USB0CLK   0x00010C0E
#define GPIO_PB3_EPI0S28   0x00010C0F

#define GPIO_PB4_U0CTS     0x00011001
#define GPIO_PB4_I2C5SCL   0x00011002
#define GPIO_PB4_SSI1FSS   0x0001100F

#define GPIO_PB5_U0RTS     0x00011401
#define GPIO_PB5_I2C5SDA   0x00011402
#define GPIO_PB5_SSI1CLK   0x0001140F

#define GPIO_PC0_TCK       0x00020001
#define GPIO_PC0_SWCLK     0x00020001

#define GPIO_PC1_TMS       0x00020401
#define GPIO_PC1_SWDIO     0x00020401

#define GPIO_PC2_TDI       0x00020801

#define GPIO_PC3_SWO       0x00020C01
#define GPIO_PC3_TDO       0x00020C01

#define GPIO_PC4_U7RX      0x00021001
#define GPIO_PC4_EPI0S7    0x0002100F

#define GPIO_PC5_U7TX      0x00021401
#define GPIO_PC5_RTCCLK    0x00021407
#define GPIO_PC5_EPI0S6    0x0002140F

#define GPIO_PC6_U5RX      0x00021801
#define GPIO_PC6_EPI0S5    0x0002180F

#define GPIO_PC7_U5TX      0x00021C01
#define GPIO_PC7_EPI0S4    0x00021C0F

#define GPIO_PD0_I2C7SCL   0x00030002
#define GPIO_PD0_T0CCP0    0x00030003
#define GPIO_PD0_C0O       0x00030005
#define GPIO_PD0_SSI2XDAT1 0x0003000F

#define GPIO_PD1_I2C7SDA   0x00030402
#define GPIO_PD1_T0CCP1    0x00030403
#define GPIO_PD1_C1O       0x00030405
#define GPIO_PD1_SSI2XDAT0 0x0003040F

#define GPIO_PD2_I2C8SCL   0x00030802
#define GPIO_PD2_T1CCP0    0x00030803
#define GPIO_PD2_C2O       0x00030805
#define GPIO_PD2_SSI2FSS   0x0003080F

#define GPIO_PD3_I2C8SDA   0x00030C02
#define GPIO_PD3_T1CCP1    0x00030C03
#define GPIO_PD3_SSI2CLK   0x00030C0F

#define GPIO_PD4_U2RX      0x00031001
#define GPIO_PD4_T3CCP0    0x00031003
#define GPIO_PD4_SSI1XDAT2 0x0003100F

#define GPIO_PD5_U2TX      0x00031401
#define GPIO_PD5_T3CCP1    0x00031403
#define GPIO_PD5_SSI1XDAT3 0x0003140F

