fenix0xf/ek-tm4c1294xl/src/drv/tivaware/driverlib/pin_map.h
#define GPIO_PF5_SSI3XDAT3   0x0005140E

#define GPIO_PG0_I2C1SCL     0x00060002
#define GPIO_PG0_M0PWM4      0x00060006
#define GPIO_PG0_EPI0S11     0x0006000F

#define GPIO_PG1_I2C1SDA     0x00060402
#define GPIO_PG1_M0PWM5      0x00060406
#define GPIO_PG1_EPI0S10     0x0006040F

#define GPIO_PG2_I2C2SCL     0x00060802
#define GPIO_PG2_EN0TXCK     0x0006080E
#define GPIO_PG2_SSI2XDAT3   0x0006080F

#define GPIO_PG3_I2C2SDA     0x00060C02
#define GPIO_PG3_EN0TXEN     0x00060C0E
#define GPIO_PG3_SSI2XDAT2   0x00060C0F

#define GPIO_PG4_U0CTS       0x00061001
#define GPIO_PG4_I2C3SCL     0x00061002
#define GPIO_PG4_EN0TXD0     0x0006100E
#define GPIO_PG4_SSI2XDAT1   0x0006100F

#define GPIO_PG5_U0RTS       0x00061401
#define GPIO_PG5_I2C3SDA     0x00061402
#define GPIO_PG5_EN0TXD1     0x0006140E
#define GPIO_PG5_SSI2XDAT0   0x0006140F

#define GPIO_PG6_I2C4SCL     0x00061802
#define GPIO_PG6_EN0RXER     0x0006180E
#define GPIO_PG6_SSI2FSS     0x0006180F

#define GPIO_PG7_I2C4SDA     0x00061C02
#define GPIO_PG7_EN0RXDV     0x00061C0E
#define GPIO_PG7_SSI2CLK     0x00061C0F

#define GPIO_PH0_U0RTS       0x00070001
#define GPIO_PH0_EPI0S0      0x0007000F

#define GPIO_PH1_U0CTS       0x00070401
#define GPIO_PH1_EPI0S1      0x0007040F

#define GPIO_PH2_U0DCD       0x00070801
#define GPIO_PH2_EPI0S2      0x0007080F

#define GPIO_PH3_U0DSR       0x00070C01
#define GPIO_PH3_EPI0S3      0x00070C0F

#define GPIO_PH4_U0DTR       0x00071001

#define GPIO_PH5_U0RI        0x00071401

#define GPIO_PH6_U5RX        0x00071801
#define GPIO_PH6_U7RX        0x00071802

#define GPIO_PH7_U5TX        0x00071C01
#define GPIO_PH7_U7TX        0x00071C02

#define GPIO_PJ0_U3RX        0x00080001

#define GPIO_PJ1_U3TX        0x00080401

#define GPIO_PJ2_U2RTS       0x00080801

#define GPIO_PJ3_U2CTS       0x00080C01

#define GPIO_PJ4_U3RTS       0x00081001

#define GPIO_PJ5_U3CTS       0x00081401

#define GPIO_PJ6_U4RTS       0x00081801

#define GPIO_PJ7_U4CTS       0x00081C01

#define GPIO_PK0_U4RX        0x00090001
#define GPIO_PK0_EPI0S0      0x0009000F

#define GPIO_PK1_U4TX        0x00090401
#define GPIO_PK1_EPI0S1      0x0009040F

#define GPIO_PK2_U4RTS       0x00090801
#define GPIO_PK2_EPI0S2      0x0009080F

#define GPIO_PK3_U4CTS       0x00090C01
#define GPIO_PK3_EPI0S3      0x00090C0F

#define GPIO_PK4_I2C3SCL     0x00091002
#define GPIO_PK4_M0PWM6      0x00091006
#define GPIO_PK4_EN0INTRN    0x00091007
#define GPIO_PK4_EN0RXD3     0x0009100E
#define GPIO_PK4_EPI0S32     0x0009100F

#define GPIO_PK5_I2C3SDA     0x00091402
#define GPIO_PK5_M0PWM7      0x00091406
#define GPIO_PK5_EN0RXD2     0x0009140E
#define GPIO_PK5_EPI0S31     0x0009140F

#define GPIO_PK6_I2C4SCL     0x00091802
#define GPIO_PK6_M0FAULT1    0x00091806
#define GPIO_PK6_EN0TXD2     0x0009180E
#define GPIO_PK6_EPI0S25     0x0009180F

#define GPIO_PK7_U0RI        0x00091C01
#define GPIO_PK7_I2C4SDA     0x00091C02
#define GPIO_PK7_RTCCLK      0x00091C05
#define GPIO_PK7_M0FAULT2    0x00091C06
#define GPIO_PK7_EN0TXD3     0x00091C0E
#define GPIO_PK7_EPI0S24     0x00091C0F

#define GPIO_PL0_I2C2SDA     0x000A0002
#define GPIO_PL0_M0FAULT3    0x000A0006
#define GPIO_PL0_USB0D0      0x000A000E
#define GPIO_PL0_EPI0S16     0x000A000F

#define GPIO_PL1_I2C2SCL     0x000A0402
#define GPIO_PL1_PHA0        0x000A0406
#define GPIO_PL1_USB0D1      0x000A040E
#define GPIO_PL1_EPI0S17     0x000A040F

#define GPIO_PL2_C0O         0x000A0805
#define GPIO_PL2_PHB0        0x000A0806
#define GPIO_PL2_USB0D2      0x000A080E
#define GPIO_PL2_EPI0S18     0x000A080F

#define GPIO_PL3_C1O         0x000A0C05
#define GPIO_PL3_IDX0        0x000A0C06
#define GPIO_PL3_USB0D3      0x000A0C0E
#define GPIO_PL3_EPI0S19     0x000A0C0F

#define GPIO_PL4_T0CCP0      0x000A1003
#define GPIO_PL4_USB0D4      0x000A100E
#define GPIO_PL4_EPI0S26     0x000A100F

#define GPIO_PL5_T0CCP1      0x000A1403
#define GPIO_PL5_EPI0S33     0x000A140F
#define GPIO_PL5_USB0D5      0x000A140E

#define GPIO_PL6_T1CCP0      0x000A1803

#define GPIO_PL7_T1CCP1      0x000A1C03

#define GPIO_PM0_T2CCP0      0x000B0003
#define GPIO_PM0_EPI0S15     0x000B000F

#define GPIO_PM1_T2CCP1      0x000B0403
#define GPIO_PM1_EPI0S14     0x000B040F

#define GPIO_PM2_T3CCP0      0x000B0803
#define GPIO_PM2_EPI0S13     0x000B080F

#define GPIO_PM3_T3CCP1      0x000B0C03
#define GPIO_PM3_EPI0S12     0x000B0C0F

#define GPIO_PM4_U0CTS       0x000B1001
#define GPIO_PM4_T4CCP0      0x000B1003
#define GPIO_PM4_EN0RREF_CLK 0x000B100E

#define GPIO_PM5_U0DCD       0x000B1401
#define GPIO_PM5_T4CCP1      0x000B1403

#define GPIO_PM6_U0DSR       0x000B1801
#define GPIO_PM6_T5CCP0      0x000B1803
#define GPIO_PM6_EN0CRS      0x000B180E

#define GPIO_PM7_U0RI        0x000B1C01
#define GPIO_PM7_T5CCP1      0x000B1C03
#define GPIO_PM7_EN0COL      0x000B1C0E

#define GPIO_PN0_U1RTS       0x000C0001

#define GPIO_PN1_U1CTS       0x000C0401

#define GPIO_PN2_U1DCD       0x000C0801
#define GPIO_PN2_U2RTS       0x000C0802
#define GPIO_PN2_EPI0S29     0x000C080F

#define GPIO_PN3_U1DSR       0x000C0C01
#define GPIO_PN3_U2CTS       0x000C0C02
#define GPIO_PN3_EPI0S30     0x000C0C0F

#define GPIO_PN4_U1DTR       0x000C1001
#define GPIO_PN4_U3RTS       0x000C1002
#define GPIO_PN4_I2C2SDA     0x000C1003
#define GPIO_PN4_EPI0S34     0x000C100F

#define GPIO_PN5_U1RI        0x000C1401
#define GPIO_PN5_U3CTS       0x000C1402
#define GPIO_PN5_I2C2SCL     0x000C1403
#define GPIO_PN5_EPI0S35     0x000C140F

#define GPIO_PN6_U4RTS       0x000C1802
#define GPIO_PN6_EN0TXER     0x000C180E

#define GPIO_PN7_U1RTS       0x000C1C01
#define GPIO_PN7_U4CTS       0x000C1C02

#define GPIO_PP0_U6RX        0x000D0001
#define GPIO_PP0_T6CCP0      0x000D0005
#define GPIO_PP0_EN0INTRN    0x000D0007
#define GPIO_PP0_SSI3XDAT2   0x000D000F

#define GPIO_PP1_U6TX        0x000D0401
#define GPIO_PP1_T6CCP1      0x000D0405
#define GPIO_PP1_SSI3XDAT3   0x000D040F

#define GPIO_PP2_U0DTR       0x000D0801
#define GPIO_PP2_USB0NXT     0x000D080E
#define GPIO_PP2_EPI0S29     0x000D080F

#define GPIO_PP3_U1CTS       0x000D0C01
#define GPIO_PP3_U0DCD       0x000D0C02
#define GPIO_PP3_RTCCLK      0x000D0C07
#define GPIO_PP3_USB0DIR     0x000D0C0E
#define GPIO_PP3_EPI0S30     0x000D0C0F

#define GPIO_PP4_U3RTS       0x000D1001
#define GPIO_PP4_U0DSR       0x000D1002
#define GPIO_PP4_USB0D7      0x000D100E

#define GPIO_PP5_U3CTS       0x000D1401
#define GPIO_PP5_I2C2SCL     0x000D1402
#define GPIO_PP5_USB0D6      0x000D140E

