fenix0xf/ek-tm4c1294xl/src/drv/tivaware/driverlib/pin_map.h
#define GPIO_PP6_U1DCD       0x000D1801
#define GPIO_PP6_I2C2SDA     0x000D1802

#define GPIO_PQ0_T6CCP0      0x000E0003
#define GPIO_PQ0_SSI3CLK     0x000E000E
#define GPIO_PQ0_EPI0S20     0x000E000F

#define GPIO_PQ1_T6CCP1      0x000E0403
#define GPIO_PQ1_SSI3FSS     0x000E040E
#define GPIO_PQ1_EPI0S21     0x000E040F

#define GPIO_PQ2_T7CCP0      0x000E0803
#define GPIO_PQ2_SSI3XDAT0   0x000E080E
#define GPIO_PQ2_EPI0S22     0x000E080F

#define GPIO_PQ3_T7CCP1      0x000E0C03
#define GPIO_PQ3_SSI3XDAT1   0x000E0C0E
#define GPIO_PQ3_EPI0S23     0x000E0C0F

#define GPIO_PQ4_U1RX        0x000E1001
#define GPIO_PQ4_DIVSCLK     0x000E1007

#define GPIO_PQ5_U1TX        0x000E1401
#define GPIO_PQ5_EN0RXD0     0x000E140E

#define GPIO_PQ6_U1DTR       0x000E1801
#define GPIO_PQ6_EN0RXD1     0x000E180E

#define GPIO_PQ7_U1RI        0x000E1C01

#define GPIO_PR0_U4TX        0x000F0001
#define GPIO_PR0_I2C1SCL     0x000F0002
#define GPIO_PR0_M0PWM0      0x000F0006

#define GPIO_PR1_U4RX        0x000F0401
#define GPIO_PR1_I2C1SDA     0x000F0402
#define GPIO_PR1_M0PWM1      0x000F0406

#define GPIO_PR2_I2C2SCL     0x000F0802
#define GPIO_PR2_M0PWM2      0x000F0806

#define GPIO_PR3_I2C2SDA     0x000F0C02
#define GPIO_PR3_M0PWM3      0x000F0C06

#define GPIO_PR4_I2C3SCL     0x000F1002
#define GPIO_PR4_T0CCP0      0x000F1003
#define GPIO_PR4_M0PWM4      0x000F1006

#define GPIO_PR5_U1RX        0x000F1401
#define GPIO_PR5_I2C3SDA     0x000F1402
#define GPIO_PR5_T0CCP1      0x000F1403
#define GPIO_PR5_M0PWM5      0x000F1406

#define GPIO_PR6_U1TX        0x000F1801
#define GPIO_PR6_I2C4SCL     0x000F1802
#define GPIO_PR6_T1CCP0      0x000F1803
#define GPIO_PR6_M0PWM6      0x000F1806

#define GPIO_PR7_I2C4SDA     0x000F1C02
#define GPIO_PR7_T1CCP1      0x000F1C03
#define GPIO_PR7_M0PWM7      0x000F1C06
#define GPIO_PR7_EN0TXEN     0x000F1C0E

#define GPIO_PS0_T2CCP0      0x00100003
#define GPIO_PS0_M0FAULT0    0x00100006

#define GPIO_PS1_T2CCP1      0x00100403
#define GPIO_PS1_M0FAULT1    0x00100406

#define GPIO_PS2_U1DSR       0x00100801
#define GPIO_PS2_T3CCP0      0x00100803
#define GPIO_PS2_M0FAULT2    0x00100806

#define GPIO_PS3_T3CCP1      0x00100C03
#define GPIO_PS3_M0FAULT3    0x00100C06

#define GPIO_PS4_T4CCP0      0x00101003
#define GPIO_PS4_PHA0        0x00101006
#define GPIO_PS4_EN0TXD0     0x0010100E

#define GPIO_PS5_T4CCP1      0x00101403
#define GPIO_PS5_PHB0        0x00101406
#define GPIO_PS5_EN0TXD1     0x0010140E

#define GPIO_PS6_T5CCP0      0x00101803
#define GPIO_PS6_IDX0        0x00101806
#define GPIO_PS6_EN0RXER     0x0010180E

#define GPIO_PS7_T5CCP1      0x00101C03
#define GPIO_PS7_EN0RXDV     0x00101C0E

#define GPIO_PT0_T6CCP0      0x00110003
#define GPIO_PT0_CAN0RX      0x00110007
#define GPIO_PT0_EN0RXD0     0x0011000E

#define GPIO_PT1_T6CCP1      0x00110403
#define GPIO_PT1_CAN0TX      0x00110407
#define GPIO_PT1_EN0RXD1     0x0011040E

#define GPIO_PT2_T7CCP0      0x00110803
#define GPIO_PT2_CAN1RX      0x00110807

#define GPIO_PT3_T7CCP1      0x00110C03
#define GPIO_PT3_CAN1TX      0x00110C07

#endif // PART_TM4C129DNCZAD

//*****************************************************************************
//
// TM4C129EKCPDT Port/Pin Mapping Definitions
//
//*****************************************************************************
#ifdef PART_TM4C129EKCPDT

#define GPIO_PA0_U0RX      0x00000001
#define GPIO_PA0_I2C9SCL   0x00000002
#define GPIO_PA0_T0CCP0    0x00000003
#define GPIO_PA0_CAN0RX    0x00000007

#define GPIO_PA1_U0TX      0x00000401
#define GPIO_PA1_I2C9SDA   0x00000402
#define GPIO_PA1_T0CCP1    0x00000403
#define GPIO_PA1_CAN0TX    0x00000407

#define GPIO_PA2_U4RX      0x00000801
#define GPIO_PA2_I2C8SCL   0x00000802
#define GPIO_PA2_T1CCP0    0x00000803
#define GPIO_PA2_SSI0CLK   0x0000080F

#define GPIO_PA3_U4TX      0x00000C01
#define GPIO_PA3_I2C8SDA   0x00000C02
#define GPIO_PA3_T1CCP1    0x00000C03
#define GPIO_PA3_SSI0FSS   0x00000C0F

#define GPIO_PA4_U3RX      0x00001001
#define GPIO_PA4_T2CCP0    0x00001003
#define GPIO_PA4_I2C7SCL   0x00001002
#define GPIO_PA4_SSI0XDAT0 0x0000100F

#define GPIO_PA5_U3TX      0x00001401
#define GPIO_PA5_T2CCP1    0x00001403
#define GPIO_PA5_I2C7SDA   0x00001402
#define GPIO_PA5_SSI0XDAT1 0x0000140F

#define GPIO_PA6_U2RX      0x00001801
#define GPIO_PA6_I2C6SCL   0x00001802
#define GPIO_PA6_T3CCP0    0x00001803
#define GPIO_PA6_USB0EPEN  0x00001805
#define GPIO_PA6_SSI0XDAT2 0x0000180D
#define GPIO_PA6_EPI0S8    0x0000180F

#define GPIO_PA7_U2TX      0x00001C01
#define GPIO_PA7_I2C6SDA   0x00001C02
#define GPIO_PA7_T3CCP1    0x00001C03
#define GPIO_PA7_USB0PFLT  0x00001C05
#define GPIO_PA7_USB0EPEN  0x00001C0B
#define GPIO_PA7_SSI0XDAT3 0x00001C0D
#define GPIO_PA7_EPI0S9    0x00001C0F

#define GPIO_PB0_U1RX      0x00010001
#define GPIO_PB0_I2C5SCL   0x00010002
#define GPIO_PB0_CAN1RX    0x00010007
#define GPIO_PB0_T4CCP0    0x00010003

#define GPIO_PB1_U1TX      0x00010401
#define GPIO_PB1_I2C5SDA   0x00010402
#define GPIO_PB1_CAN1TX    0x00010407
#define GPIO_PB1_T4CCP1    0x00010403

#define GPIO_PB2_T5CCP0    0x00010803
#define GPIO_PB2_I2C0SCL   0x00010802
#define GPIO_PB2_USB0STP   0x0001080E
#define GPIO_PB2_EPI0S27   0x0001080F

#define GPIO_PB3_I2C0SDA   0x00010C02
#define GPIO_PB3_T5CCP1    0x00010C03
#define GPIO_PB3_USB0CLK   0x00010C0E
#define GPIO_PB3_EPI0S28   0x00010C0F

#define GPIO_PB4_U0CTS     0x00011001
#define GPIO_PB4_I2C5SCL   0x00011002
#define GPIO_PB4_SSI1FSS   0x0001100F

#define GPIO_PB5_U0RTS     0x00011401
#define GPIO_PB5_I2C5SDA   0x00011402
#define GPIO_PB5_SSI1CLK   0x0001140F

#define GPIO_PC0_TCK       0x00020001
#define GPIO_PC0_SWCLK     0x00020001

#define GPIO_PC1_TMS       0x00020401
#define GPIO_PC1_SWDIO     0x00020401

#define GPIO_PC2_TDI       0x00020801

#define GPIO_PC3_SWO       0x00020C01
#define GPIO_PC3_TDO       0x00020C01

#define GPIO_PC4_U7RX      0x00021001
#define GPIO_PC4_EPI0S7    0x0002100F

#define GPIO_PC5_U7TX      0x00021401
#define GPIO_PC5_RTCCLK    0x00021407
#define GPIO_PC5_EPI0S6    0x0002140F

#define GPIO_PC6_U5RX      0x00021801
#define GPIO_PC6_EPI0S5    0x0002180F

#define GPIO_PC7_U5TX      0x00021C01
#define GPIO_PC7_EPI0S4    0x00021C0F

