fenix0xf/ek-tm4c1294xl/src/drv/tivaware/driverlib/pin_map.h
#define GPIO_PD1_I2C7SDA     0x00030402
#define GPIO_PD1_T0CCP1      0x00030403
#define GPIO_PD1_C1O         0x00030405
#define GPIO_PD1_SSI2XDAT0   0x0003040F

#define GPIO_PD2_I2C8SCL     0x00030802
#define GPIO_PD2_T1CCP0      0x00030803
#define GPIO_PD2_C2O         0x00030805
#define GPIO_PD2_SSI2FSS     0x0003080F

#define GPIO_PD3_I2C8SDA     0x00030C02
#define GPIO_PD3_T1CCP1      0x00030C03
#define GPIO_PD3_SSI2CLK     0x00030C0F

#define GPIO_PD4_U2RX        0x00031001
#define GPIO_PD4_T3CCP0      0x00031003
#define GPIO_PD4_SSI1XDAT2   0x0003100F

#define GPIO_PD5_U2TX        0x00031401
#define GPIO_PD5_T3CCP1      0x00031403
#define GPIO_PD5_SSI1XDAT3   0x0003140F

#define GPIO_PD6_U2RTS       0x00031801
#define GPIO_PD6_T4CCP0      0x00031803
#define GPIO_PD6_USB0EPEN    0x00031805
#define GPIO_PD6_SSI2XDAT3   0x0003180F

#define GPIO_PD7_U2CTS       0x00031C01
#define GPIO_PD7_T4CCP1      0x00031C03
#define GPIO_PD7_USB0PFLT    0x00031C05
#define GPIO_PD7_NMI         0x00031C08
#define GPIO_PD7_SSI2XDAT2   0x00031C0F

#define GPIO_PE0_U1RTS       0x00040001

#define GPIO_PE1_U1DSR       0x00040401

#define GPIO_PE2_U1DCD       0x00040801

#define GPIO_PE3_U1DTR       0x00040C01
#define GPIO_PE3_OWIRE       0x00040C05

#define GPIO_PE4_U1RI        0x00041001
#define GPIO_PE4_SSI1XDAT0   0x0004100F

#define GPIO_PE5_SSI1XDAT1   0x0004140F

#define GPIO_PE6_U0CTS       0x00041801
#define GPIO_PE6_I2C9SCL     0x00041802

#define GPIO_PE7_U0RTS       0x00041C01
#define GPIO_PE7_I2C9SDA     0x00041C02
#define GPIO_PE7_NMI         0x00041C08

#define GPIO_PF0_EN0LED0     0x00050005
#define GPIO_PF0_M0PWM0      0x00050006
#define GPIO_PF0_SSI3XDAT1   0x0005000E
#define GPIO_PF0_TRD2        0x0005000F

#define GPIO_PF1_EN0LED2     0x00050405
#define GPIO_PF1_M0PWM1      0x00050406
#define GPIO_PF1_SSI3XDAT0   0x0005040E
#define GPIO_PF1_TRD1        0x0005040F

#define GPIO_PF2_EN0MDC      0x00050805
#define GPIO_PF2_M0PWM2      0x00050806
#define GPIO_PF2_SSI3FSS     0x0005080E
#define GPIO_PF2_TRD0        0x0005080F

#define GPIO_PF3_EN0MDIO     0x00050C05
#define GPIO_PF3_M0PWM3      0x00050C06
#define GPIO_PF3_SSI3CLK     0x00050C0E
#define GPIO_PF3_TRCLK       0x00050C0F

#define GPIO_PF4_EN0LED1     0x00051005
#define GPIO_PF4_M0FAULT0    0x00051006
#define GPIO_PF4_SSI3XDAT2   0x0005100E
#define GPIO_PF4_TRD3        0x0005100F

#define GPIO_PF5_SSI3XDAT3   0x0005140E

#define GPIO_PF6_LCDMCLK     0x0005180F

#define GPIO_PF7_LCDDATA02   0x00051C0F

#define GPIO_PG0_I2C1SCL     0x00060002
#define GPIO_PG0_EN0PPS      0x00060005
#define GPIO_PG0_M0PWM4      0x00060006
#define GPIO_PG0_EPI0S11     0x0006000F

#define GPIO_PG1_I2C1SDA     0x00060402
#define GPIO_PG1_M0PWM5      0x00060406
#define GPIO_PG1_EPI0S10     0x0006040F

#define GPIO_PG2_I2C2SCL     0x00060802
#define GPIO_PG2_EN0TXCK     0x0006080E
#define GPIO_PG2_SSI2XDAT3   0x0006080F

#define GPIO_PG3_I2C2SDA     0x00060C02
#define GPIO_PG3_EN0TXEN     0x00060C0E
#define GPIO_PG3_SSI2XDAT2   0x00060C0F

#define GPIO_PG4_U0CTS       0x00061001
#define GPIO_PG4_I2C3SCL     0x00061002
#define GPIO_PG4_OWIRE       0x00061005
#define GPIO_PG4_EN0TXD0     0x0006100E
#define GPIO_PG4_SSI2XDAT1   0x0006100F

#define GPIO_PG5_U0RTS       0x00061401
#define GPIO_PG5_I2C3SDA     0x00061402
#define GPIO_PG5_OWALT       0x00061405
#define GPIO_PG5_EN0TXD1     0x0006140E
#define GPIO_PG5_SSI2XDAT0   0x0006140F

#define GPIO_PG6_I2C4SCL     0x00061802
#define GPIO_PG6_OWIRE       0x00061805
#define GPIO_PG6_EN0RXER     0x0006180E
#define GPIO_PG6_SSI2FSS     0x0006180F

#define GPIO_PG7_I2C4SDA     0x00061C02
#define GPIO_PG7_OWIRE       0x00061C05
#define GPIO_PG7_EN0RXDV     0x00061C0E
#define GPIO_PG7_SSI2CLK     0x00061C0F

#define GPIO_PH0_U0RTS       0x00070001
#define GPIO_PH0_EPI0S0      0x0007000F

#define GPIO_PH1_U0CTS       0x00070401
#define GPIO_PH1_EPI0S1      0x0007040F

#define GPIO_PH2_U0DCD       0x00070801
#define GPIO_PH2_EPI0S2      0x0007080F

#define GPIO_PH3_U0DSR       0x00070C01
#define GPIO_PH3_EPI0S3      0x00070C0F

#define GPIO_PH4_U0DTR       0x00071001

#define GPIO_PH5_U0RI        0x00071401
#define GPIO_PH5_EN0PPS      0x00071405

#define GPIO_PH6_U5RX        0x00071801
#define GPIO_PH6_U7RX        0x00071802

#define GPIO_PH7_U5TX        0x00071C01
#define GPIO_PH7_U7TX        0x00071C02

#define GPIO_PJ0_U3RX        0x00080001
#define GPIO_PJ0_EN0PPS      0x00080005

#define GPIO_PJ1_U3TX        0x00080401

#define GPIO_PJ2_U2RTS       0x00080801
#define GPIO_PJ2_LCDDATA14   0x0008080F

#define GPIO_PJ3_U2CTS       0x00080C01
#define GPIO_PJ3_LCDDATA15   0x00080C0F

#define GPIO_PJ4_U3RTS       0x00081001
#define GPIO_PJ4_LCDDATA16   0x0008100F

#define GPIO_PJ5_U3CTS       0x00081401
#define GPIO_PJ5_LCDDATA17   0x0008140F

#define GPIO_PJ6_U4RTS       0x00081801
#define GPIO_PJ6_LCDAC       0x0008180F

#define GPIO_PJ7_U4CTS       0x00081C01

#define GPIO_PK0_U4RX        0x00090001
#define GPIO_PK0_EPI0S0      0x0009000F

#define GPIO_PK1_U4TX        0x00090401
#define GPIO_PK1_EPI0S1      0x0009040F

#define GPIO_PK2_U4RTS       0x00090801
#define GPIO_PK2_EPI0S2      0x0009080F

#define GPIO_PK3_U4CTS       0x00090C01
#define GPIO_PK3_EPI0S3      0x00090C0F

#define GPIO_PK4_I2C3SCL     0x00091002
#define GPIO_PK4_EN0LED0     0x00091005
#define GPIO_PK4_M0PWM6      0x00091006
#define GPIO_PK4_EN0INTRN    0x00091007
#define GPIO_PK4_EN0RXD3     0x0009100E
#define GPIO_PK4_EPI0S32     0x0009100F

#define GPIO_PK5_I2C3SDA     0x00091402
#define GPIO_PK5_EN0LED2     0x00091405
#define GPIO_PK5_M0PWM7      0x00091406
#define GPIO_PK5_EN0RXD2     0x0009140E
#define GPIO_PK5_EPI0S31     0x0009140F

#define GPIO_PK6_I2C4SCL     0x00091802
#define GPIO_PK6_EN0LED1     0x00091805
#define GPIO_PK6_M0FAULT1    0x00091806
#define GPIO_PK6_EN0TXD2     0x0009180E
#define GPIO_PK6_EPI0S25     0x0009180F

#define GPIO_PK7_U0RI        0x00091C01
#define GPIO_PK7_I2C4SDA     0x00091C02
#define GPIO_PK7_RTCCLK      0x00091C05
#define GPIO_PK7_M0FAULT2    0x00091C06
#define GPIO_PK7_EN0TXD3     0x00091C0E
#define GPIO_PK7_EPI0S24     0x00091C0F

#define GPIO_PL0_I2C2SDA     0x000A0002
#define GPIO_PL0_M0FAULT3    0x000A0006
#define GPIO_PL0_USB0D0      0x000A000E
#define GPIO_PL0_EPI0S16     0x000A000F

